In [1]:
import pandas as pd

In [5]:
minha_serie = pd.Series([4,7,-5,3])

In [8]:
minha_serie[minha_serie > 0]

0    4
1    7
3    3
dtype: int64

In [9]:
minha_serie[0]

4

In [10]:
import numpy as np

In [11]:
np.log(minha_serie[minha_serie > 0])

0    1.386294
1    1.945910
3    1.098612
dtype: float64

In [16]:
1 in minha_serie #busca no index

True

In [17]:
2 in minha_serie.values #busca os valores

False

In [18]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [22]:
meu_frame = pd.DataFrame(data)

In [24]:
meu_frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
meu_frame[meu_frame['pop'] > 2]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
meu_frame[meu_frame['year'] >= 2001]

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
meu_frame[(meu_frame['pop'] > 2) & (meu_frame['year'] >= 2001)]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [30]:
meu_frame['state'].unique()

array(['Ohio', 'Nevada'], dtype=object)

In [31]:
meu_frame.T

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [36]:
meu_frame['debt'] = np.arange(6)

In [38]:
meu_frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [39]:
meu_frame.at[1:2, 'debt'] = 11

In [40]:
meu_frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7    11
2    Ohio  2002  3.6    11
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [45]:
meu_frame[(meu_frame['state'] == 'Nevada') | (meu_frame['year'] == 2002)]

    state  year  pop  debt
2    Ohio  2002  3.6    11
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [46]:
meu_frame.describe()

              year       pop       debt
count     6.000000  6.000000   6.000000
mean   2001.500000  2.550000   5.666667
std       1.048809  0.836062   4.457204
min    2000.000000  1.500000   0.000000
25%    2001.000000  1.875000   3.250000
50%    2001.500000  2.650000   4.500000
75%    2002.000000  3.125000   9.500000
max    2003.000000  3.600000  11.000000